[
  {
    "title": "Stock Market",
    "createdAt": "09/06/2023",
    "image": "https://images.pexels.com/photos/534216/pexels-photo-534216.jpeg?cs=srgb&dl=pexels-pixabay-534216.jpg&fm=jpg",
    "author": "Wikipedia",
    "text": "A stock market, equity market, or share market is the aggregation of buyers and sellers of stocks (also called shares), which represent ownership claims on businesses these may include securities listed on a public stock exchange, as well as stock that is only traded privately, such as shares of private companies which are sold to investors through equity crowdfunding platforms. Investment is usually made with an investment strategy in mind. \nThe total market capitalization of all publicly traded securities worldwide rose from US$2.5 trillion in 1980 to US$93.7 trillion at the end of 2020. As of 2016, there are 60 stock exchanges in the world. Of these, there are 16 exchanges with a market capitalization of $1 trillion or more, and they account for 87% of global market capitalization. Apart from the Australian Securities Exchange, these 16 exchanges are all in North America, Europe, or Asia. By country, the largest stock markets as of January 2022 are in the United States of America (about 59.9%), followed by Japan (about 6.2%) and United Kingdom (about 3.9%)."
  },
  {
    "title": "How to analyze an IPO?",
    "createdAt": "25/07/2023",
    "image": "https://media.warriortrading.com/2017/01/Blog_IPO-1.jpg",
    "author": "IIFL Securities",
    "text": "Every business that wants to fund its operations or scale in the future has one thing in common: they all need cash. The cash is required to fund its current operations and fulfill the need to expand and increase profitability. A company can use the revenue to fund its day-to-day operations. But what about growing the business and achieving expansion goals? Expanding the business requires a large number of funds as the company may need to invest in infrastructure, human resources, or acquire new businesses. \n The first alternative for a company to get cash is to take a bank loan. However, companies feel bank loans are tough as they require collateral and are limited to a certain amount. The second and the most widely used way for companies to raise capital is through an Initial Public Offering."
  },
  {
    "title": "How to Save: Strategies for Saving Money Each Month",
    "createdAt": "26/07/2023",
    "image": "https://d32ijn7u0aqfv4.cloudfront.net/wp/wp-content/uploads/raw/SOBK0622029_1560x880_desktop.jpeg",
    "author": "Credit Counselling Society",
    "text": "One of the best saving strategies is to pay yourself first. What this means is that you designate a certain amount of your paycheque as your pay (how novel) and you pay that money to yourself before you pay your bills or anyone else. This amount can be $25, $100 or maybe 10% of your paycheque. It can be any amount that you decide. The important part is that you pay yourself first rather than last. Most people pay all of the bills first and then save anything that might be left over. For most people, that method of saving doesn’t really work because nothing is left over to save.\n If you pay yourself first, then money will get saved because paying yourself is now your first priority. The nice thing about this method is if your budget is a little tight, it forces you to make adjustments elsewhere and your savings continue to grow.\nPaying yourself first also makes sense. Why are you going to work everyday anyway? To earn money for someone else? No way. You go to work to earn money for you and your family. That's why you should pay yourself first—to make sure that your first priority is taken care of: you. It is not likely that anyone else is going to take care of you because they assume that you are taking care of yourself."
  },
  {
    "title": "A Canadian Money Saver Guide for Beginners",
    "createdAt": "21/08/2021",
    "image": "https://www.canadianmoneysaver.ca/img/703_750_436_preview.jpg",
    "author": "Canadian MoneySaver",
    "text": "It Starts With Budgeting: \n\nWrite down income and expenses: A first step to take for financial awareness.\nUnderstand fixed versus variable expenses: Fixed expenses help with predictability in the budget. Tracking variable expenses helps improve your discretion in spending.\nDivide expense items into wants and needs: Here you can put things in percentages and see if it makes sense.\nFind out what can be automated for both bills and savings: They key here is that it eliminates some of the decision making and 'forces' you to save.\nMake savings a 'mandatory' bill to yourself: This helps with getting into a mindset of savings more than anything else."
  },
  {
    "title": "A Complete Beginner's Guide to Saving Money",
    "createdAt": "06/12/2022",
    "image": "https://www.thebalancemoney.com/thmb/ylwyVBRKRoS9Ip5Iw4bPyko3bH0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/GettyImages-591404067-68e06c4ce0e3488b9e0d0fd6db5c3ae9.jpg",
    "author": "Joshua Kennon",
    "text": "Saving money, or the \"saving habit\"—as American author Napoleon Hill put it many years ago—is the foundation of all financial success.1 Having money saved is what provides the means for you to take advantage of situations—whether it's going back to college, starting a new business, or buying shares of stock when the market crashes.\n  There is a huge difference between saving and investing. Both saving money and investing money have a place in your life, but they play very different roles. \nHow you handle these two things can have big implications for your financial success and stress level, and how wealthy you will ultimately become. It can even mean the difference between suffering through a recession or depression and sleeping soundly through the night, knowing that you have enough spare liquidity on hand "
  },
  {
    "title": "What is Fundamental Analysis ?",
    "createdAt": "06/12/2022",
    "image": "https://www.thebalancemoney.com/thmb/ylwyVBRKRoS9Ip5Iw4bPyko3bH0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/GettyImages-591404067-68e06c4ce0e3488b9e0d0fd6db5c3ae9.jpg",
    "author": "RBC",
    "text": "When considering an investment, have you ever checked out a company's products, financial statements, its management team or the markets where it operates? Welcome to fundamental analysis!\nWith fundamental analysis, investors gather as much information as they can to better understand a company and help determine the intrinsic – or true – value of its stock. It's a useful approach when trying to figure out which company (or companies) to invest in.\nFundamental analysis focuses on getting to know a company and understanding some of the factors that may affect its stock price. It can give you a better understanding of a company's true value, which can help you determine if it's the right investment choice for your portfolio.\nMany investment professionals consider fundamental analysis to be the most important step in the investment process. By examining a company's financial health, future growth prospects, the strength of its brand name and the quality of the management team, you'll be in a better position to determine if the stock is underpriced, fairly priced or overpriced."
  }
]
