[
  {
    "name": "How does the stock market work? - Oliver Elfenbaum",
    "createdAt": "29/04/2019",
    "videoID": "p7HKvqRI_Bo",
    "author": "TED-Ed",
    "description": "In the 1600s, the Dutch East India Company employed hundreds of ships to trade goods around the globe. In order to fund their voyages, the company turned to private citizens to invest money to support trips in exchange for a share of the profits. In doing so, they unknowingly invented the world’s first stock market. So how do companies and investors use the market today? Oliver Elfenbaum explains."
  },
  {
    "name": "Top 5 Tips to Analyze an IPO the Best Way",
    "createdAt": "12/07/2021",
    "videoID": "1iBlLTvIxX8",
    "author": "Prateek Singh (LearnApp)",
    "description": "It's raining IPOs in the markets. Here's a 5-point checklist to help you analyze an IPO the right way! And if you're applying for an IPO anytime soon (Devyani International IPO, anyone?), then this video is for you!"
  },
  {
    "name": "Top 10 Analysis Parameters for IPOs",
    "createdAt": "21/07/2021",
    "videoID": "tbc8zLcbW5Q",
    "author": "CA Rachana Phadke Ranade",
    "description": "Investing in an IPO is one of the best ways to create wealth in the long term. You get to participate in the company’s growth quite early on, giving you the chance to grow your capital. However, there have been many instances where companies either had stellar debuts in the stock exchange and then later failed to impress or did abysmally when their shares were listed. \n This is precisely why it is important to carry out an extensive analysis of an upcoming IPO before investing in it. Proper analysis will give you just the information you need to make an informed investment decision. So, let’s take a look at how you, as an investor, can analyze an IPO. "
  },
  {
    "name": "Market Capitalization of Stocks",
    "createdAt": "13/09/2019",
    "videoID": "9oZ12W6P9Eo",
    "author": "The Organic Chemistry Tutor",
    "description": "This video discusses how to calculate the market capitalization of stocks in a company.  The market capitalization is the product of the outstanding shares and the share price of each stock.  The shares outstanding is the sum of the restricted shares and the float."
  },
  {
    "name": "Financial Planning: Emergency Funds Explained",
    "createdAt": "08/01/2020",
    "videoID": "3hikDqf9GW4",
    "author": "CA Rachana Phadke Ranade",
    "description": "Learn what should be your First Step in Financial Planning. What is Emergency Fund and how you should create and manage the emergency fund ?"
  },
  {
    "name": "Building An Emergency Fund",
    "createdAt": "12/03/2021",
    "videoID": "UNRm5ygb-xI",
    "author": "Aja Dang",
    "description": "How much is too much in an emergency fund? I asked this question on Instagram and I got a wide range of answers, and a few surprised me. Some people wanted to save up +$100,000 in their emergency fund (someone even told me they wanted to have $250,000 in their emergency fund). And while I'm all here for you wanting to be prepared for the worst, the question must be asked: is that really the best use of your money?\nI know many people didn't know the different between an emergency fund and a savings fund so in this video, we'll go through the Emergency Fund basics: what is it, what is it for, where to put it, etc. And I answer the question WHY having $100,000 in your emergency fund might not be the best financial decision. "
  },
  {
    "name": "The 7 Baby Steps Explained",
    "createdAt": "20/09/2021",
    "videoID": "OO25TrVo_dU",
    "author": "Dave Ramsey",
    "description": "Step 1: $1,000 in an emergency fund. \n Step 2: Pay off all debt except the house utilizing the debt snowball. \n Step 3: Three to six months of savings in a fully funded emergency fund. \n Step 4: Invest 15% of your household income into Roth IRAs and pre-tax retirement plans. \n Step 5: College Funding \n Step 6: Pay off your home early. \n Step 7: Build wealth and give."
  },
  {
    "name": "How to Read the Candlestick Chart",
    "createdAt": "10/06/2021",
    "videoID": "PKA66mjQ79E",
    "author": "Tanmay Bhat",
    "description": "Get familiar with trends- upward, downward, and sideways, and the types of charts used in technical analysis. Learn to analyse candlestick patterns and the market psychology behind these patterns with the help of some real-world examples. Further, understand the concepts like gapping up and bullish/bearish engulfing, and hammer chart patterns which eventually help us in building trading systems."
  },
  {
    "name": "Trading Indicators Explained",
    "createdAt": "16/06/2021",
    "videoID": "ZYaujgRX1V8",
    "author": "Tanmay Bhat",
    "description": "Technical indicators are mathematical calculations that can be very daunting for a beginner. In the 5th episode of 'Basics of Trading with Tanmay and Prateek', Prateek discusses the three major indicators used in Technical Analysis, i.e. Moving average, Exponential Moving Average, and RSI. By the end of this episode, you'll have a good understanding of how these three indicators are used in trading."
  },
  {
    "name": "Profit & Loss, Balance Sheet",
    "createdAt": "05/07/2019",
    "videoID": "_FzLo1BmP4Q",
    "author": "CA Rachana Phadke Ranade",
    "description": "The balance sheet and the profit and loss (P&L) statement are two of the three financial statements companies issue regularly. Such statements provide an ongoing record of a company's financial condition and are used by creditors, market analysts and investors to evaluate a company's financial soundness and growth potential. The third financial statement is called the cash-flow statement. "
  },
  {
    "name": "Economy And Industry Analysis",
    "createdAt": "20/07/2019",
    "videoID": "D3mVJvSz9WQ",
    "author": "CA Rachana Phadke Ranade",
    "description": "Industry analysis is normally the second step after you are through with a detailed study of the macroeconomic and microeconomic environment. There are a number of factors that go into industry analysis like the life cycle of the industry, level of maturity, profitability of the industry, prospects for consolidation etc. The next step is to evaluate some of the unique features of the industry and why the industry structure could make the investment in the stock attractive. Here are 3 important industry analysis models."
  },
  {
    "name": "ITC Ltd. Fundamental Analysis",
    "createdAt": "09/02/2020",
    "videoID": "IRHs-s07pPY",
    "author": "CA Rachana Phadke Ranade",
    "description": "ITC share price is on a rollercoaster, Government is punishing the sin goods with extra tax, the Indian economy has slowed down, in these challenging situation how ITC can perform and the big question, as the ITC stock price has collapsed, Should you Invest in ITC Share? \nThis Case Study on ITC Ltd. shows the history of ITC, different business segments of ITC, Financial and Q3 results. Learn from the analysis of CA Rachana Ranade the value ITC stock holds."
  },
  {
    "name": "SBI Card IPO Review",
    "createdAt": "29/02/2020",
    "videoID": "hzSqepQGMA4",
    "author": "CA Rachana Phadke Ranade",
    "description": "India's second-largest credit card issuer company SBI Cards and Payment Services is coming up with an initial public offering (IPO) which will be open for subscription for four days from March 2 to March 5."
  }
]
